# Challenge 3

In this challenge we will work on the `Orders.csv` data set in the previous [Subsetting and Descriptive Stats lab](../../lab-subsetting-and-descriptive-stats/your-code/main.ipynb). In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

# Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [1]:
# import required libraries
import numpy as np
import pandas as pd

Next, import `Orders.csv` from the "subsetting" lab folder into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [6]:
# enter your code here
orders = pd.read_csv("Orders.csv")
orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

In [46]:
# your code here
customers = orders[['CustomerID', 'amount_spent']]
amounts = customers.groupby('CustomerID').sum().sort_values('amount_spent',ascending=False)
amounts.head()

            amount_spent
CustomerID
14646          280206.02
18102          259657.30
17450          194550.79
16446          168472.50
14911          143825.06

In [27]:
amounts['Percentile_rank']=amounts.amount_spent.rank(pct=True)
amounts.head()

            amount_spent  Percentile_rank
CustomerID
14646          280206.02         1.000000
18102          259657.30         0.999770
17450          194550.79         0.999539
16446          168472.50         0.999309
14911          143825.06         0.999078

In [38]:
preferred = amounts[(amounts['Percentile_rank']>=0.75) & (amounts['Percentile_rank']<0.95)]
preferred.head()

            amount_spent  Percentile_rank
CustomerID
13050            5836.86         0.949988
12720            5781.73         0.949758
15218            5756.89         0.949528
17686            5739.46         0.949297
13178            5725.47         0.949067

In [39]:
VIP = amounts[amounts['Percentile_rank']>0.95]
VIP.head()

            amount_spent  Percentile_rank
CustomerID
14646          280206.02         1.000000
18102          259657.30         0.999770
17450          194550.79         0.999539
16446          168472.50         0.999309
14911          143825.06         0.999078

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

# Q2: How to identify which country has the most VIP Customers?

# Q3: How to identify which country has the most VIP+Preferred Customers combined?

Provide your solution for Q2 below:

In [48]:
# your code here
customers2 = orders[['CustomerID', 'amount_spent', 'Country']]
amounts2 = customers2.groupby(['Country','CustomerID']).sum().sort_values('amount_spent',ascending=False)
amounts2

                           amount_spent
Country        CustomerID
Netherlands    14646          280206.02
United Kingdom 18102          259657.30
               17450          194550.79
               16446          168472.50
EIRE           14911          143825.06
Australia      12415          124914.53
EIRE           14156          117379.63
United Kingdom 17511           91062.38
               16029           81024.84
               12346           77183.60
               16684           66653.56
               14096           65164.79
               13694           65039.62
               15311           60767.90
               13089           58825.83
               17949           58510.48
               15769           56252.72
               15061           54534.14
               14298           51527.30
               14088           50491.81
               15749           44534.30
               12931           42055.96
               17841           40991.57
               15098           39916.50
               13798           37153.85
               16013           37130.60
               16422           34684.40
               12748           33719.73
               15838           33643.08
Sweden         17404           31906.82
...                                 ...
United Kingdom 14589              39.75
               12977              39.24
               16659              39.12
               18019              38.45
               12855              38.10
               16162              37.40
               17816              36.56
               15940              35.80
               14576              35.40
               17831              35.40
               16856              35.40
               15744              34.80
               16765              34.00
               17408              32.65
               13120              30.60
               15657              30.00
               18268              25.50
               17102              25.50
               17986              20.80
               16953              20.80
               16093              17.00
               15823              15.00
               17763              15.00
               13307              15.00
               16878              13.30
               17956              12.75
               16454               6.90
               14792               6.20
               16738               3.75
               13256               0.00

[4347 rows x 1 columns]

In [49]:
amounts2['Percentile_rank']=amounts2.amount_spent.rank(pct=True)
amounts2.head()

                           amount_spent  Percentile_rank
Country        CustomerID
Netherlands    14646          280206.02          1.00000
United Kingdom 18102          259657.30          0.99977
               17450          194550.79          0.99954
               16446          168472.50          0.99931
EIRE           14911          143825.06          0.99908

In [52]:
preferred2 = amounts2[(amounts2['Percentile_rank']>=0.75) & (amounts2['Percentile_rank']<0.95)]
preferred2.head()

                           amount_spent  Percentile_rank
Country        CustomerID
United Kingdom 15218            5756.89          0.94985
               17686            5739.46          0.94962
               13178            5725.47          0.94939
               16553            5719.82          0.94916
               13468            5704.97          0.94893

In [53]:
VIP2 = amounts2[amounts2['Percentile_rank']>0.95]
VIP2.head()

                           amount_spent  Percentile_rank
Country        CustomerID
Netherlands    14646          280206.02          1.00000
United Kingdom 18102          259657.30          0.99977
               17450          194550.79          0.99954
               16446          168472.50          0.99931
EIRE           14911          143825.06          0.99908

In [70]:
pref = preferred2.reset_index().groupby('Country').count().sort_values('CustomerID',ascending=False)[['CustomerID']]
pref.head()

                CustomerID
Country
United Kingdom         756
Germany                 28
France                  20
Belgium                 11
Switzerland              6

In [71]:
vip = VIP2.reset_index().groupby('Country').count().sort_values('CustomerID',ascending=False)[['CustomerID']]
vip.head()

                CustomerID
Country
United Kingdom         178
Germany                 11
France                   9
Switzerland              3
Spain                    2

In [74]:
merged_df = pref.merge(vip, left_index=True, right_index=True)
merged_df.head()

                CustomerID_x  CustomerID_y
Country
United Kingdom           756           178
Germany                   28            11
France                    20             9
Switzerland                6             3
Norway                     6             1

In [75]:
merged_df['comb'] = merged_df['CustomerID_x'] + merged_df['CustomerID_y']

In [76]:
merged_df.head()

                CustomerID_x  CustomerID_y  comb
Country
United Kingdom           756           178   934
Germany                   28            11    39
France                    20             9    29
Switzerland                6             3     9
Norway                     6             1     7